src/cf/Documents/уатСписаниеАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатСписаниеАгрегатов</Name>
			<BasedOn>
				<xr:Item>Document.уатИнвентаризацияАгрегатов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатОстаткиАгрегатов</xr:Item>
				<xr:Item>AccumulationRegister.уатИзносАгрегатов</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
				<xr:Item>AccumulationRegister.уатСписаниеАгрегатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатИнвентаризацияАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПланыПримененияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Comment>Причина списания</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПричиныСписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аккумуляторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Comment>Причина списания</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПричиныСписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеАгрегаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Comment>Причина списания</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПричиныСписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатОприходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатОприходованиеТоваров</Name>
			<Comment>Оприходование материалов (уат)</Comment>
			<BasedOn>
				<xr:Item>Document.уатИнвентаризацияТоваров</xr:Item>
				<xr:Item>Document.уатСписаниеАгрегатов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатТоварыВЯчейках</xr:Item>
				<xr:Item>InformationRegister.уатДатыДвиженияТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатСпецодеждаИИнструментыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатСписаниеАгрегатов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатИнвентаризацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>(Общ) Основание (статья) оприходования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Агрегат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/уатСерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСерииНоменклатуры</Name>
			<Comment>Агрегаты (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель агрегата</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная стоимость агрегата</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта первоначальной стоимости</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваШины</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСлужбыШины</Name>
					<Comment>Срок службы, мес.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/уатСписаниеАгрегатов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.Организация) И ПолучитьФункциональнуюОпцию("уатИспользоватьУчетДоходовИРасходов") Тогда
			Если Не уатОбщегоНазначения.уатНайтиПланЗатрат(Объект.ПланЗатрат, Объект.Организация, Неопределено) Тогда
				//ТекстНСТР = НСтр("en='Cost plan is not found!';ru='Не найден план затрат!'");
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.Подразделение, "Объект.Организация");
	Если ЗначениеЗаполнено(Объект.СкладТоваров) Тогда
		ВозвратНаСклад = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// Установить видимость реквизитов и заголовков колонок.
	УстановитьВидимость();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Перем Команда;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		ВыбранноеЗначение.Свойство("Команда", Команда);
		
		Если Команда = "ПодборВТабличнуюЧастьШины" Тогда
			ОбработкаПодбора("Шины", ВыбранноеЗначение);
		ИначеЕсли Команда = "ПодборВТабличнуюЧастьАккумуляторы" Тогда
			ОбработкаПодбора("Аккумуляторы", ВыбранноеЗначение);
		ИначеЕсли Команда = "ПодборВТабличнуюЧастьПрочиеАгрегаты" Тогда
			ОбработкаПодбора("ПрочиеАгрегаты",ВыбранноеЗначение)	
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// проверка заполнения Склада товаров при возврате на склад
	Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
		И ВозвратНаСклад И НЕ ЗначениеЗаполнено(Объект.СкладТоваров) Тогда
		
		ТекстНСТР = НСтр("en='The warehouse for return materials is not full!';ru='Не заполнен склад материалов для возврата!'");
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ,, СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;

	Если НЕ Объект.Ссылка.Пустая() И НЕ флОтключитьКонтрольОприходованияТоваров Тогда 
		КонтрольОприходованияТоваров();
		Если ЗначениеЗаполнено(КорректировкаОприходованиеМатериалов) Тогда
			Отказ = Истина;
			ДопПараметры = Новый Структура("ПараметрыЗаписи", ПараметрыЗаписи);
			Оповещ = Новый ОписаниеОповещения("ПередЗаписьюКорректировкаОприходованиеМатериалов", ЭтотОбъект, ДопПараметры);
			ТекстВопроса = "Обнаружено расхождение состава номенклатуры в Списании агрегатов и Оприходовании материалов.
				|Скорректировать Оприходование материалов?";
			ПоказатьВопрос(Оповещ, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюКорректировкаОприходованиеМатериалов(Результат, ДопПараметры) Экспорт
	
	флОтключитьКонтрольОприходованияТоваров = Ложь;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СкорректироватьОприходованиеТоваров();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		КорректировкаОприходованиеМатериалов = Неопределено;
		флОтключитьКонтрольОприходованияТоваров = Истина;
		флЗакрыватьПриЗаписи = Истина;
	Иначе
		флЗакрыватьПриЗаписи = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Записать(ДопПараметры.ПараметрыЗаписи) И флЗакрыватьПриЗаписи И Открыта() Тогда
		Закрыть();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СоздатьОприходованиеТоваров(ПараметрыЗаписи);
	
	Если флЗакрыватьПриЗаписи И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ИспользоватьУчетЗатрат()
		И НЕ уатОбщегоНазначения.уатНайтиПланЗатрат(Объект.ПланЗатрат, Объект.Организация, Неопределено, Неопределено) Тогда
			
		ТекстНСТР = НСтр("en='Cost plan is not found!';ru='Не найден план затрат!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратНаСкладПриИзменении(Элемент)
	
	Если НЕ ВозвратНаСклад Тогда
		Объект.СкладТоваров = Неопределено;
	КонецЕсли;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПрочиеАгрегаты

&НаКлиенте
Процедура ПрочиеАгрегатыСерияНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ТипАгрегата, РежимВыбора", "ПрочиеАгрегаты", Истина);
	ОткрытьФорму("Справочник.уатСерииНоменклатуры.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Объект_ЗаписатьИЗакрыть(Команда)
	
	флЗакрыватьПриЗаписи = Истина;
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборАккумуляторов(Команда)
	ДействиеПодбор("Аккумуляторы");
КонецПроцедуры

&НаКлиенте
Процедура ПодборПрочихАгрегатов(Команда)
	ДействиеПодбор("ПрочиеАгрегаты");
КонецПроцедуры

&НаКлиенте
Процедура ПодборШин(Команда)
	ДействиеПодбор("Шины");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ДействиеПодбор(ИмяТабличнойЧасти)
	
	Если ИмяТабличнойЧасти = "Шины" Тогда
		Команда = "ПодборВТабличнуюЧастьШины";
	ИначеЕсли ИмяТабличнойЧасти = "Аккумуляторы" Тогда
		Команда = "ПодборВТабличнуюЧастьАккумуляторы";
	ИначеЕсли ИмяТабличнойЧасти =  "ПрочиеАгрегаты" Тогда
		Команда = "ПодборВТабличнуюЧастьПрочиеАгрегаты";
	КонецЕсли;
	СтруктураПараметровПодбора = Новый Структура();
	СтруктураПараметровПодбора.Вставить("Организация", Объект.Организация);
	СтруктураПараметровПодбора.Вставить("Команда", Команда);
	
	//СтруктураПараметровПодбора.Вставить("ПодбиратьУслуги", ЕстьУслуги);
	//СтруктураПараметровПодбора.Вставить("ОтборУслугПоСправочнику", Истина);
	
	ВременнаяДатаРасчетов = ?(НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()), Неопределено, Объект.Дата);
	СтруктураПараметровПодбора.Вставить("ДатаРасчетов", ВременнаяДатаРасчетов);
	СтруктураПараметровПодбора.Вставить("Склад", Объект.Склад);
	
	уатОбщегоНазначенияТиповыеКлиент.уатОткрытьПодборАгрегатов(ЭтотОбъект, СтруктураПараметровПодбора);
	
КонецПроцедуры //

// Производит заполнение документа переданными из формы подбора данными.
//
// Параметры:
//  ТабличнаяЧасть    - табличная часть, в которую надо добавлять подобранную позицию агрегата;
//  ЗначениеВыбора    - структура, содержащая параметры подбора.
//
&НаКлиенте
Процедура ОбработкаПодбора(ИмяТабличнойЧасти, ЗначениеВыбора)
	
	Перем МассивАгрегатов, Модель;
	
	// Получим параметры подбора из структуры подбора.
	ЗначениеВыбора.Свойство("МассивАгрегатов",МассивАгрегатов);
	
	Для каждого Агрегат Из МассивАгрегатов Цикл
		
		// Ищем выбранную позицию в таблице подобранных агрегатов.
		// Если найдем - выдаем сообщение; не найдем - добавим новую строку.
		СтруктураОтбора = Новый Структура("СерияНоменклатуры", Агрегат);
		
		МассивСтрок = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаТабличнойЧасти = Неопределено;
		Иначе
			СтрокаТабличнойЧасти = МассивСтрок[0];
		КонецЕсли;
		
		Если СтрокаТабличнойЧасти <> Неопределено Тогда
			// Нашли, сообщаем.
			ТекстНСТР = СтрШаблон(НСтр("en='Сar part %1 was added earlier!';ru='Агрегат ""%1"" был добавлен ранее!'"), Строка(Агрегат));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Иначе
			// Не нашли - добавляем новую строку.
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти].Добавить();
			СтрокаТабличнойЧасти.СерияНоменклатуры	  = Агрегат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ПланЗатрат.Видимость = ИспользоватьУчетЗатрат();
	Элементы.СкладТоваров.Доступность = ВозвратНаСклад;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользоватьУчетЗатрат()
	Возврат ПолучитьФункциональнуюОпцию("уатИспользоватьУчетДоходовИРасходов");
КонецФункции

&НаСервере
Процедура КонтрольОприходованияТоваров()
	
	ДокументОприходование = НайтиОприходованиеТоваровНаОснованииСписанияАгрегатов(Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(ДокументОприходование) Тогда
		Возврат;
	КонецЕсли;
	
	КорректировкаОприходованиеМатериалов = Неопределено;
	
	// Проверка соответствия номенклатуры в текущем документе и документе-основании
	СписаниеАгрегатовОбъект = РеквизитФормыВЗначение("Объект");
	тблСписанияСвернутая = Документы.уатСписаниеАгрегатов.ПолучитьМатериалыДляОприходованияНаСклад(СписаниеАгрегатовОбъект);
	тблСписанияСвернутая.Свернуть("Номенклатура, ЕдиницаИзмерения", "Количество");
	тблОприходованияСвернутая = ДокументОприходование.Товары.Выгрузить();
	тблОприходованияСвернутая.Свернуть("Номенклатура, ЕдиницаИзмерения", "Количество");
	Если НЕ ОбщегоНазначения.КоллекцииИдентичны(тблСписанияСвернутая, тблОприходованияСвернутая) Тогда
		КорректировкаОприходованиеМатериалов = ДокументОприходование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиОприходованиеТоваровНаОснованииСписанияАгрегатов(СписаниеАгрегатов)
	Если НЕ ЗначениеЗаполнено(СписаниеАгрегатов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Рез = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатОприходованиеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.уатОприходованиеТоваров КАК уатОприходованиеТоваров
	|ГДЕ
	|	НЕ уатОприходованиеТоваров.ПометкаУдаления
	|	И уатОприходованиеТоваров.ДокументОснование = &ДокументОснование");
	Запрос.УстановитьПараметр("ДокументОснование", СписаниеАгрегатов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура СоздатьОприходованиеТоваров(ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.СкладТоваров) ИЛИ НЕ Объект.Проведен
		ИЛИ ЗначениеЗаполнено(НайтиОприходованиеТоваровНаОснованииСписанияАгрегатов(Объект.Ссылка)) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.уатОприходованиеТоваров.ФормаОбъекта", ПараметрыФормы);
		
КонецПроцедуры

&НаСервере
Процедура СкорректироватьОприходованиеТоваров()
	
	Если НЕ ЗначениеЗаполнено(КорректировкаОприходованиеМатериалов) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ОприходованиеМатериаловОбъект = КорректировкаОприходованиеМатериалов.ПолучитьОбъект();
	ОприходованиеМатериаловОбъект.Заполнить(ДокументОбъект);
	Попытка
		ОприходованиеМатериаловОбъект.Записать(?(ОприходованиеМатериаловОбъект.Проведен,
			РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		КорректировкаОприходованиеМатериалов = Неопределено;
	Исключение
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке("Не удалось записать документ " + ОприходованиеМатериаловОбъект.Ссылка
			+ ": " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
